<template>
  <div class="md-body">
    <h1>В этом приложении:</h1>
    <ul>
      <li>Полная настройка шаблона на Vue CLI</li>
      <li>Установка и настройка Vue-router для Vue.js 2</li>
      <li>Динамическая перерисовка без перезагрузки страницы</li>
      <li>Динамичный навбар и ссылки</li>
      <li>Обработка несуществующих роутов</li>
      <li>Хеши и моды для роутера</li>
      <li>Настройка общего конфига</li>
      <li>Использование Vuex</li>
    </ul>
    <h2>И мелочи:</h2>
    <ul>
      <li>Полное настройка для переиспользования шаблона</li>
      <li>Универсальный компонент списка и форм</li>
      <li>Добавление приоритета для заметки</li>
      <li>Редактирование заметок</li>
      <li>Фильтрация заметок</li>
    </ul>
    <p>
      Сделано на курсе
      <a href="https://app.tocode.ru/courses/vue-pro/">Vue 2 - С нуля до про</a
      >
    </p>
  </div>
</template>
